Repository: TeaOk210/flutterRegistrationApp
Catalog: lib/l10n/intl_*.arb
Languages: ru

# language
source: English
ru: Русский

# reg
source: Registration
ru: Регистрация

# ent
source: Entry
ru: Вход

# regBtn
source: sign up
ru: зарегистрироваться

# entBtn
source: log in
ru: войти

# orEnt
source: or log in
ru: или войти

# orReg
source: or sign up
ru: или зарегистрироваться

# google
source: Using google
ru: С помощью google

# email
source: Your mail is
ru: Ваша почта

# emailStateTrue
source: confirmed
ru: подтверждена

# emailStateFalse
source: not confirmed
ru: не подтверждена

# reportEmail
source: Confirm mail
ru: Подтвердить почту

# signOut
source: Log out of account
ru: Выйти из аккауниа

# emailReport
source: Incorrect email format
ru: Некорректный формат email

# passwordReport
source: The password must contain numbers and letters, and be at least 8 characters
ru: Пароль должен содержать цифры и буквы, и быть не менее 8 символов

# usernameReport
source: The field should not be empty!
ru: Поле не должно быть пустым!

# registrationMailReport
source: the mail is already registered
ru: Почта уже зарегистрирована

# loginPasswordReport
source: Invalid password, or it does not exist
ru: Неверный пароль, либо его не существует

# loginUserReport
source: User not found
ru: Пользователь не найден
